//MARBDB2  JOB (124400000),'INVENTORY',CLASS=A,MSGCLASS=X,
//      NOTIFY=&SYSUID
//PROC  JCLLIB ORDER=BRIGHT.MARBLES.PROCLIB
//STEP1 EXEC MARBDB2
//SYSIN DD  *
  SELECT * FROM EVENT.MARBLE
/*