         01 VKSD-RECORD.
           05 VKSD-KEY            PIC X(6).
           05 FILLER              PIC X.
           05 VSAM-LAST-NAME      PIC X(10).
           05 VSAM-FIRST-NAME     PIC X(10).
           05 VSAM-STREET-ADDRESS PIC X(10).
           05 VSAM-CITY           PIC X(10).
           05 VSAM-POSTAL-CODE    PIC X(5).