      01 MARBLERECORD.
         05 COLOR               PIC X(10).
         05 FILLER              PIC X.
         05 INVENTORY           PIC 9(3).
         05 FILLER              PIC X.
         05 COST                PIC 9(3).